       IDENTIFICATION DIVISION.
       PROGRAM-ID.  MonPremierCOBOL.
       
       PROCEDURE DIVISION.
       DisplayPrompt.
           DISPLAY "Salut tout le monde !".
           STOP RUN.
